# Q 1,2,3

In [9]:
import pandas as pd
from IPython.display import display

data = {
    "Tid" : [1,2,3,4,5,6,7,8,9,10],
    "Refund" : ['Yes','No','No','Yes','No','No','Yes','No','No','No'],
    "Marital Status" : ["Single",'Married','Single','Married','Divorced','Married','Divorced','Single','Married','Single'],
    "Taxable Income" : ['125K','100K','70K','120K','95K','60K','220K','85K','75K','90K'],
    "Cheat" : ['No','No','No','No','Yes','No','No','Yes','No','Yes']
}

df = pd.DataFrame(data)

display(df)
print(df)

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
1    2     No        Married           100K    No
2    3     No         Single            70K    No
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K    No
6    7    Yes       Divorced           220K    No
7    8     No         Single            85K   Yes
8    9     No        Married            75K    No
9   10     No         Single            90K   Yes

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
1    2     No        Married           100K    No
2    3     No         Single            70K    No
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K    No
6    7    Yes       Divorced           220K    No
7    8     No         Single            85K   Yes
8    9     No        Married            75K    No
9   10     No         Single            90K   Yes

In [10]:
display(df.iloc[[0, 4, 7, 8]])

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
4    5     No       Divorced            95K   Yes
7    8     No         Single            85K   Yes
8    9     No        Married            75K    No

In [11]:
print(df.iloc[3:7])
print(df.iloc[4:8, 2:4])

   Tid Refund Marital Status Taxable Income Cheat
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K    No
6    7    Yes       Divorced           220K    No
  Marital Status Taxable Income
4       Divorced            95K
5        Married            60K
6       Divorced           220K
7         Single            85K

# Q.4
* Read a csv file and display its first five rows.
* Note-: Download dataset from https://www.kaggle.com/datasets/uciml/iris)
# Q.5
 * From the csv file (uploaded in the Q.4) delete row 4, and delete column 3. Display the
result.

In [12]:
import pandas as pd
from IPython.display import display

df_csv = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')
print("Original DataFrame:")
display(df_csv.head())

Original DataFrame:

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [13]:
# Reset index to ensure proper integer-based indexing
df_csv.reset_index(drop=True, inplace=True)

# Drop the fourth row (index 3)
df_csv = df_csv.drop(index=3)

# Drop the third column
df_csv = df_csv.drop(columns=df_csv.columns[2])

print("Updated DataFrame:")
print(df_csv.head())

Updated DataFrame:
   sepal_length  sepal_width  petal_width species
0           5.1          3.5          0.2  setosa
1           4.9          3.0          0.2  setosa
2           4.7          3.2          0.2  setosa
4           5.0          3.6          0.2  setosa
5           5.4          3.9          0.4  setosa

## Q6
* WAP to determine the following using dataset in Q6:
* a) Shape (number of rows and columns) of the DataFrame.
* b) Summary of the DataFrame that includes the data types and non-null counts for each column.
* c) Generate descriptive statistics.
* d) Display the first 5 rows and last 3 rows of the dataset.
* e) Calculate the following statistics from the dataset: i. The average salary of employees.
ii. The total bonus paid to all employees.
iii. The youngest employee's age.
iv. The highest performance rating.
* f) Sort the DataFrame by the Salary column in descending order.
* g) Add a new column that categorizes employees based on their performance rating:
i. Excellent for ratings >= 4.5
ii. Good for ratings >= 4.0 but < 4.5
iii. Average for ratings < 4.0
* h) Identify missing values in the DataFrame.
* i) Rename the Employee_ID column to ID.
* j) Find all employees who:
i. Have more than 5 years of experience.
ii. Belong to the IT department.
* k) Modify the dataset by adding a new column, Tax, which deducts 10% of the
Salary.
 l) Save the modified DataFrame (with added columns) to a new CSV file.

In [14]:
import pandas as pd

data = {
    'Employee_Id' : [101, 102, 103, 104, 105],
    'Name' : ['Alice', 'Bob', 'Charlie', 'Diana','Edward'],
    'Department' : ['HR', 'IT', 'IT', 'Marketing', 'Sales'],
    'Age' : [29,34,41,28,38],
    'Salary' : [50000, 70000, 65000, 55000, 60000],
    'Years of Experience' : [4,8,10,3,12],
    'Joining Date' : ['2020-03-15 ','2017-07-19','2013-06-01','2021-02-10','2010-11-25 '],
    'Gender' : ['Female','Male','Male',"Female",'Male'],
    'Bonus' : [5000,7000,6000,4500,5000],
    'Rating' : [4.5,4.0,3.8,4.7,3.5]
}

df = pd.DataFrame(data)
display(df)

,Employee_Id,Name,Department,Age,Salary,Years of Experience,Joining Date,Gender,Bonus,Rating
0,101,Alice,HR,29,50000,4,2020-03-15,Female,5000,4.5
1,102,Bob,IT,34,70000,8,2017-07-19,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,2013-06-01,Male,6000,3.8
3,104,Diana,Marketing,28,55000,3,2021-02-10,Female,4500,4.7
4,105,Edward,Sales,38,60000,12,2010-11-25,Male,5000,3.5

In [16]:
#get shape
print("Shape: ", df.shape)


print('\nSummary: ',df.info())

Shape:  (5, 10)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_Id          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years of Experience  5 non-null      int64
 6   Joining Date         5 non-null      object
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes

Summary:  None

In [17]:
# Get descriptive statistics
print(df.describe())

       Employee_Id        Age       Salary  Years of Experience   Bonus  \
count     5.000000   5.000000      5.00000             5.000000     5.0
mean    103.000000  34.000000  60000.00000             7.400000  5500.0
std       1.581139   5.612486   7905.69415             3.847077  1000.0
min     101.000000  28.000000  50000.00000             3.000000  4500.0
25%     102.000000  29.000000  55000.00000             4.000000  5000.0
50%     103.000000  34.000000  60000.00000             8.000000  5000.0
75%     104.000000  38.000000  65000.00000            10.000000  6000.0
max     105.000000  41.000000  70000.00000            12.000000  7000.0

         Rating
count  5.000000
mean   4.100000
std    0.494975
min    3.500000
25%    3.800000
50%    4.000000
75%    4.500000
max    4.700000

In [18]:
# Display the first 5 rows
print("First 5 rows of the dataset:")
display(df.head())

# Display the last 3 rows
print("Last 3 rows of the dataset:")
print(df.tail(3))

First 5 rows of the dataset:

,Employee_Id,Name,Department,Age,Salary,Years of Experience,Joining Date,Gender,Bonus,Rating
0,101,Alice,HR,29,50000,4,2020-03-15,Female,5000,4.5
1,102,Bob,IT,34,70000,8,2017-07-19,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,2013-06-01,Male,6000,3.8
3,104,Diana,Marketing,28,55000,3,2021-02-10,Female,4500,4.7
4,105,Edward,Sales,38,60000,12,2010-11-25,Male,5000,3.5

Last 3 rows of the dataset:
   Employee_Id     Name Department  Age  Salary  Years of Experience  \
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining Date  Gender  Bonus  Rating
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4  2010-11-25     Male   5000     3.5

In [19]:
# Calculate specific statistics
print("Average Salary:", df["Salary"].mean())
print("Total Bonus:", df["Bonus"].sum())
print("Youngest Employee Age:", df["Age"].min())
print("Highest Rating:", df["Rating"].max())

Average Salary: 60000.0
Total Bonus: 27500
Youngest Employee Age: 28
Highest Rating: 4.7

In [20]:
# Sort by Salary in descending order
sorted_df = df.sort_values(by="Salary", ascending=False)
display(sorted_df)

,Employee_Id,Name,Department,Age,Salary,Years of Experience,Joining Date,Gender,Bonus,Rating
1,102,Bob,IT,34,70000,8,2017-07-19,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,2013-06-01,Male,6000,3.8
4,105,Edward,Sales,38,60000,12,2010-11-25,Male,5000,3.5
3,104,Diana,Marketing,28,55000,3,2021-02-10,Female,4500,4.7
0,101,Alice,HR,29,50000,4,2020-03-15,Female,5000,4.5

In [23]:
filtered_df = df[(df["Years of Experience"] > 5) & (df["Department"] == "IT")]
print(filtered_df)

   Employee_Id     Name Department  Age  Salary  Years of Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10

  Joining Date Gender  Bonus  Rating
1   2017-07-19   Male   7000     4.0
2   2013-06-01   Male   6000     3.8

In [24]:
print(df.isnull().sum())

Employee_Id            0
Name                   0
Department             0
Age                    0
Salary                 0
Years of Experience    0
Joining Date           0
Gender                 0
Bonus                  0
Rating                 0
dtype: int64

In [25]:
# Rename the Employee_ID column to ID.
print("Renaming Employee_ID to ID")
df.rename(columns={"Employee_ID":"ID"},inplace=True)
print(df)
print("\n")

Renaming Employee_ID to ID
   Employee_Id     Name Department  Age  Salary  Years of Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining Date  Gender  Bonus  Rating
0  2020-03-15   Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4  2010-11-25     Male   5000     3.5

In [30]:
print("Employees have more than 5 years of experience\n")
Data_required=df[(df["Years of Experience"]>5)]
print(Data_required)
print("\n")

print("Employees belong to IT department\n")
Data_required=df[(df["Department"]=="IT")]
display(Data_required)
print("\n")

Employees have more than 5 years of experience

   Employee_Id     Name Department  Age  Salary  Years of Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      Sales   38   60000                   12

  Joining Date Gender  Bonus  Rating
1   2017-07-19   Male   7000     4.0
2   2013-06-01   Male   6000     3.8
4  2010-11-25    Male   5000     3.5


Employees belong to IT department

,Employee_Id,Name,Department,Age,Salary,Years of Experience,Joining Date,Gender,Bonus,Rating
1,102,Bob,IT,34,70000,8,2017-07-19,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,2013-06-01,Male,6000,3.8

In [32]:
print("Adding a new colum Tax")
df["Tax"] = df["Salary"] * 0.1
display(df)

Adding a new colum Tax

,Employee_Id,Name,Department,Age,Salary,Years of Experience,Joining Date,Gender,Bonus,Rating,Tax
0,101,Alice,HR,29,50000,4,2020-03-15,Female,5000,4.5,5000.0
1,102,Bob,IT,34,70000,8,2017-07-19,Male,7000,4.0,7000.0
2,103,Charlie,IT,41,65000,10,2013-06-01,Male,6000,3.8,6500.0
3,104,Diana,Marketing,28,55000,3,2021-02-10,Female,4500,4.7,5500.0
4,105,Edward,Sales,38,60000,12,2010-11-25,Male,5000,3.5,6000.0

In [34]:
df.to_csv('new_employees.csv',index=False)